In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame({"no1" :["name","Joe","Mary"],"no2":["age",5,12],"no3":["score",23,25]})
df.head()

    no1  no2    no3
0  name  age  score
1   Joe    5     23
2  Mary   12     25

In [30]:
df2= df.iloc[1:3,:]
df2.columns=df.iloc[0,:]

In [31]:
df2

0  name age score
1   Joe   5    23
2  Mary  12    25

In [32]:
df.iloc[1:3,:]

    no1 no2 no3
1   Joe   5  23
2  Mary  12  25